#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fsaero/core-infrastructure/runs/run-1kcWSEQ7e4tkBgNG

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.available: Refreshing state... [id=eu-central-1]
aws_route53_zone.this: Refreshing state... [id=Z01286593R86ROZGB79GK]
module.vpc.data.aws_vpc_endpoint_service.s3[0]: Refreshing state...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02fd7c3ee8dc8b0d5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04b97a690510d2518]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c9bea91b61fd2224]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-085f4f248a7260279]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a3e045be6bf48b24]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0801b402375ef488f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0529e8fd3a9b6e9ba]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00aa57bb2fc9de755]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c912140f06d9756f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-087f4720f07423109]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cda6bf73bebecbda]
module.vpc.aws_egress_only_internet_gateway.this[0]: Refreshing state... [id=eigw-0307e8d293adc6cf8]
module.vpc.aws_route.private_ipv6_egress[0]: Refreshing state... [id=r-rtb-0801b402375ef488f2750132062]
module.vpc.aws_route.private_ipv6_egress[2]: Refreshing state... [id=r-rtb-0801b402375ef488f2750132062]
module.vpc.aws_route.private_ipv6_egress[1]: Refreshing state... [id=r-rtb-0801b402375ef488f2750132062]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f9c70f652fe29857]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0cc86e8812f83855b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0529e8fd3a9b6e9ba1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02d777fffb3cb9c24]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09875da3181fb6000]
module.vpc.aws_route.public_internet_gateway_ipv6[0]: Refreshing state... [id=r-rtb-0529e8fd3a9b6e9ba2750132062]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-059fbcb891972af65]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08ae1a974a379ee3d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03aecb0fdf50c6b1a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0801b402375ef488f1080289494]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_vpc_endpoint.s3[0] will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-02fd7c3ee8dc8b0d5"
    }

  # module.vpc.aws_vpc_endpoint_route_table_association.private_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = "rtb-0801b402375ef488f"
      + vpc_endpoint_id = (known after apply)
    }

  # module.vpc.aws_vpc_endpoint_route_table_association.public_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "public_s3" {
      + id              = (known after apply)
      + route_table_id  = "rtb-0529e8fd3a9b6e9ba"
      + vpc_endpoint_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @lorenzoaiello, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Check`*